egilll/zephyr-gd32/drivers/i2s/i2s_gd32.c
/*
 * Copyright (c) 2026 The Zephyr Project Contributors
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT gd_gd32_i2s

#include <errno.h>
#include <string.h>

#include <zephyr/cache.h>
#include <zephyr/device.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/gd32.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_gd32.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/util.h>

#include <gd32_rcu.h>
#include <gd32_spi.h>

LOG_MODULE_REGISTER(i2s_gd32, CONFIG_I2S_LOG_LEVEL);

#define GD32_I2S_DISABLE_POLL_PERIOD K_MSEC(1)
#define GD32_I2S_DISABLE_TIMEOUT_MS  50

#define GD32_I2SPSC_DEFAULT_VALUE 0x00000002U

struct queue_item {
	void *mem_block;
	size_t size;
};

struct i2s_gd32_dma {
	const struct device *dev;
	uint32_t channel;
	uint32_t slot;
	uint32_t config;
	uint32_t fifo_threshold;
};

struct i2s_gd32_config {
	uint32_t reg;
	uint16_t clkid;
	struct reset_dt_spec reset;
	const struct pinctrl_dev_config *pcfg;
	bool mck_enabled;
	void (*irq_configure)(const struct device *dev);
	struct i2s_gd32_dma dma_rx;
	struct i2s_gd32_dma dma_tx;
};

struct stream {
	const struct device *dev;
	enum i2s_dir dir;

	enum i2s_state state;
	struct k_msgq *msgq;
	struct i2s_config cfg;

	const struct device *dma_dev;
	uint32_t dma_channel;
	uint32_t dma_slot;
	uint32_t dma_priority;

	struct dma_config dma_cfg;
	struct dma_block_config dma_blk;

	void *mem_block;
	size_t mem_block_size;
	uint32_t last_block_start_cycle;

	bool master;
	bool tx_stop_for_drain;

	struct k_work_delayable stop_work;
	bool disable_pending;
	int64_t disable_deadline_ms;
};

struct i2s_gd32_data {
	struct stream rx;
	struct stream tx;
	struct k_spinlock lock;
};

static inline bool queue_is_empty(struct k_msgq *q)
{
	return k_msgq_num_used_get(q) == 0;
}

static int queue_get(struct k_msgq *q, void **mem_block, size_t *size, int32_t timeout)
{
	struct queue_item item;
	int ret = k_msgq_get(q, &item, SYS_TIMEOUT_MS(timeout));

	if (ret == 0) {
		*mem_block = item.mem_block;
		*size = item.size;
	}

	return ret;
}

static int queue_put(struct k_msgq *q, void *mem_block, size_t size, int32_t timeout)
{
	struct queue_item item = {
		.mem_block = mem_block,
		.size = size,
	};

	return k_msgq_put(q, &item, SYS_TIMEOUT_MS(timeout));
}

static void stream_queue_drop(struct stream *s)
{
	size_t size;
	void *mem_block;

	if (s->cfg.mem_slab == NULL) {
		return;
	}

	while (queue_get(s->msgq, &mem_block, &size, 0) == 0) {
		k_mem_slab_free(s->cfg.mem_slab, mem_block);
	}
}

static int gd32_wait_flag_set(rcu_flag_enum flag, uint32_t timeout_ms)
{
	int64_t deadline = k_uptime_get() + timeout_ms;

	while (rcu_flag_get(flag) == RESET) {
		if (k_uptime_get() >= deadline) {
			return -ETIMEDOUT;
		}
		k_sleep(K_MSEC(1));
	}

	return 0;
}

static void gd32_i2s_frameformat_apply(uint32_t reg, uint32_t frameformat)
{
	SPI_I2SCTL(reg) &= (uint32_t)(~(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
	SPI_I2SCTL(reg) |= frameformat;
}

static int gd32_i2s_psc_config(uint32_t reg, uint32_t audiosample_hz, uint32_t frameformat,
			       uint32_t mckout)
{
	uint32_t i2sdiv = 2U, i2sof = 0U;
	uint32_t clks;
	uint32_t i2sclock;
	uint32_t plli2sm, plli2sn, plli2sr;

	SPI_I2SPSC(reg) = GD32_I2SPSC_DEFAULT_VALUE;

	rcu_osci_on(RCU_HXTAL);
	int ret = gd32_wait_flag_set(RCU_FLAG_HXTALSTB, 100);
	if (ret < 0) {
		return ret;
	}

	rcu_osci_on(RCU_PLLI2S_CK);
	ret = gd32_wait_flag_set(RCU_FLAG_PLLI2SSTB, 100);
	if (ret < 0) {
		return ret;
	}

	rcu_i2s_clock_config(RCU_I2SSRC_PLLI2S);

	plli2sm = (uint32_t)(RCU_PLL & RCU_PLL_PLLPSC);
	plli2sn = (uint32_t)((RCU_PLLI2S & RCU_PLLI2S_PLLI2SN) >> 6);
	plli2sr = (uint32_t)((RCU_PLLI2S & RCU_PLLI2S_PLLI2SR) >> 28);

	if ((RCU_PLL & RCU_PLL_PLLSEL) == RCU_PLLSRC_HXTAL) {
		i2sclock = (uint32_t)(((HXTAL_VALUE / plli2sm) * plli2sn) / plli2sr);
	} else {
		i2sclock = (uint32_t)(((IRC16M_VALUE / plli2sm) * plli2sn) / plli2sr);
	}

	if (mckout == I2S_MCKOUT_ENABLE) {
		clks = (uint32_t)(((i2sclock / 256U) * 10U) / audiosample_hz);
	} else {
		if (frameformat == I2S_FRAMEFORMAT_DT16B_CH16B) {
			clks = (uint32_t)(((i2sclock / 32U) * 10U) / audiosample_hz);
		} else {
			clks = (uint32_t)(((i2sclock / 64U) * 10U) / audiosample_hz);
		}
	}

	clks = (clks + 5U) / 10U;
	i2sof = (clks & 0x00000001U);
	i2sdiv = ((clks - i2sof) / 2U);
	i2sof = (i2sof << 8U);

	if ((i2sdiv < 2U) || (i2sdiv > 255U)) {
		i2sdiv = 2U;
		i2sof = 0U;
	}

	SPI_I2SPSC(reg) = (uint32_t)(i2sdiv | i2sof | mckout);
	gd32_i2s_frameformat_apply(reg, frameformat);

	return 0;
}

static uint32_t gd32_i2s_dma_xfer_count(size_t bytes)
{
	return (uint32_t)(bytes / sizeof(uint16_t));
}

static void gd32_i2s_rx_disable(struct stream *stream)
{
	const struct i2s_gd32_config *cfg = stream->dev->config;

	spi_dma_disable(cfg->reg, SPI_DMA_RECEIVE);
	(void)dma_stop(stream->dma_dev, stream->dma_channel);
	SPI_CTL1(cfg->reg) &= ~SPI_CTL1_ERRIE;
	i2s_disable(cfg->reg);

	if (stream->mem_block != NULL) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
	}
}

static void gd32_i2s_tx_disable_dma(struct stream *stream)
{
	const struct i2s_gd32_config *cfg = stream->dev->config;

	spi_dma_disable(cfg->reg, SPI_DMA_TRANSMIT);
	(void)dma_stop(stream->dma_dev, stream->dma_channel);
	SPI_CTL1(cfg->reg) &= ~SPI_CTL1_ERRIE;
}

static void gd32_i2s_tx_stop_work(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct stream *stream = CONTAINER_OF(dwork, struct stream, stop_work);
	const struct i2s_gd32_config *cfg = stream->dev->config;
	struct i2s_gd32_data *data = stream->dev->data;
	k_spinlock_key_t key = k_spin_lock(&data->lock);

	if (!stream->disable_pending) {
		k_spin_unlock(&data->lock, key);
		return;
	}

	if ((SPI_STAT(cfg->reg) & SPI_STAT_TBE) && !(SPI_STAT(cfg->reg) & SPI_STAT_TRANS)) {
		i2s_disable(cfg->reg);
		stream->disable_pending = false;
		k_spin_unlock(&data->lock, key);
		return;
	}

