egilll/zephyr-gd32/drivers/i2s/i2s_gd32.c
	if (k_uptime_get() >= stream->disable_deadline_ms) {
		i2s_disable(cfg->reg);
		stream->disable_pending = false;
		k_spin_unlock(&data->lock, key);
		return;
	}

	k_spin_unlock(&data->lock, key);
	(void)k_work_schedule(&stream->stop_work, GD32_I2S_DISABLE_POLL_PERIOD);
}

static void gd32_i2s_noop_work(struct k_work *work)
{
	ARG_UNUSED(work);
}

static void gd32_i2s_request_tx_disable(struct stream *stream)
{
	struct i2s_gd32_data *data = stream->dev->data;
	k_spinlock_key_t key = k_spin_lock(&data->lock);

	stream->disable_pending = true;
	stream->disable_deadline_ms = k_uptime_get() + GD32_I2S_DISABLE_TIMEOUT_MS;

	k_spin_unlock(&data->lock, key);
	(void)k_work_schedule(&stream->stop_work, K_NO_WAIT);
}

static void gd32_i2s_dma_callback(const struct device *dma_dev, void *arg, uint32_t channel,
				  int status)
{
	struct stream *stream = arg;
	const struct device *dev = stream->dev;
	const struct i2s_gd32_config *cfg = dev->config;
	struct i2s_gd32_data *data = dev->data;
	k_spinlock_key_t key = k_spin_lock(&data->lock);

	ARG_UNUSED(dma_dev);
	ARG_UNUSED(channel);

	if (status < 0) {
		stream->state = I2S_STATE_ERROR;
		if (stream->dir == I2S_DIR_RX) {
			gd32_i2s_rx_disable(stream);
		} else {
			gd32_i2s_tx_disable_dma(stream);
			gd32_i2s_request_tx_disable(stream);
		}
		k_spin_unlock(&data->lock, key);
		return;
	}

	if (stream->dir == I2S_DIR_RX) {
		void *filled_block = stream->mem_block;

		__ASSERT_NO_MSG(filled_block != NULL);

		sys_cache_data_invd_range(filled_block, stream->cfg.block_size);

		if (queue_put(stream->msgq, filled_block, stream->cfg.block_size, 0) < 0) {
			stream->mem_block = NULL;
			stream->state = I2S_STATE_ERROR;
			k_mem_slab_free(stream->cfg.mem_slab, filled_block);
			gd32_i2s_rx_disable(stream);
			k_spin_unlock(&data->lock, key);
			return;
		}

		stream->mem_block = NULL;

		if (stream->state == I2S_STATE_STOPPING) {
			stream->state = I2S_STATE_READY;
			gd32_i2s_rx_disable(stream);
			k_spin_unlock(&data->lock, key);
			return;
		}

		if (k_mem_slab_alloc(stream->cfg.mem_slab, &stream->mem_block, K_NO_WAIT) < 0) {
			stream->state = I2S_STATE_ERROR;
			gd32_i2s_rx_disable(stream);
			k_spin_unlock(&data->lock, key);
			return;
		}

		const uint32_t count = gd32_i2s_dma_xfer_count(stream->cfg.block_size);
		(void)dma_reload(stream->dma_dev, stream->dma_channel, (uint32_t)&SPI_DATA(cfg->reg),
				 (uint32_t)stream->mem_block, count);
		(void)dma_start(stream->dma_dev, stream->dma_channel);
		k_spin_unlock(&data->lock, key);
		return;
	}

	__ASSERT_NO_MSG(stream->mem_block != NULL);

	k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
	stream->mem_block = NULL;
	stream->mem_block_size = 0;

	if (stream->state == I2S_STATE_STOPPING) {
		if (stream->tx_stop_for_drain && !queue_is_empty(stream->msgq)) {
			/* continue below */
		} else {
			stream->state = I2S_STATE_READY;
			gd32_i2s_tx_disable_dma(stream);
			gd32_i2s_request_tx_disable(stream);
			k_spin_unlock(&data->lock, key);
			return;
		}
	}

	if (queue_get(stream->msgq, &stream->mem_block, &stream->mem_block_size, 0) < 0) {
		stream->state = I2S_STATE_ERROR;
		gd32_i2s_tx_disable_dma(stream);
		gd32_i2s_request_tx_disable(stream);
		k_spin_unlock(&data->lock, key);
		return;
	}

	sys_cache_data_flush_range(stream->mem_block, stream->mem_block_size);

	const uint32_t count = gd32_i2s_dma_xfer_count(stream->mem_block_size);
	(void)dma_reload(stream->dma_dev, stream->dma_channel, (uint32_t)stream->mem_block,
			 (uint32_t)&SPI_DATA(cfg->reg), count);
	stream->last_block_start_cycle = k_cycle_get_32();
	(void)dma_start(stream->dma_dev, stream->dma_channel);

	k_spin_unlock(&data->lock, key);
}

static bool gd32_i2s_dma_busy(struct stream *stream)
{
	struct dma_status stat;

	if (dma_get_status(stream->dma_dev, stream->dma_channel, &stat) != 0) {
		return true;
	}

	return stat.busy;
}

static int gd32_std_from_config(const struct i2s_config *cfg, uint32_t *std)
{
	switch (cfg->format & I2S_FMT_DATA_FORMAT_MASK) {
	case I2S_FMT_DATA_FORMAT_I2S:
		*std = I2S_STD_PHILLIPS;
		return 0;
	case I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED:
		*std = I2S_STD_MSB;
		return 0;
	case I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED:
		*std = I2S_STD_LSB;
		return 0;
	case I2S_FMT_DATA_FORMAT_PCM_SHORT:
		*std = I2S_STD_PCMSHORT;
		return 0;
	case I2S_FMT_DATA_FORMAT_PCM_LONG:
		*std = I2S_STD_PCMLONG;
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int gd32_frameformat_from_config(const struct i2s_config *cfg, uint32_t *fmt)
{
	if (cfg->word_size == 16U) {
		*fmt = I2S_FRAMEFORMAT_DT16B_CH16B;
		return 0;
	}

	return -ENOTSUP;
}

static int gd32_i2s_validate_config(const struct i2s_config *cfg)
{
	if ((cfg->format & I2S_FMT_DATA_ORDER_LSB) != 0U) {
		return -ENOTSUP;
	}

	if ((cfg->format & I2S_FMT_FRAME_CLK_INV) != 0U) {
		return -ENOTSUP;
	}

	if ((cfg->options & (I2S_OPT_PINGPONG | I2S_OPT_LOOPBACK | I2S_OPT_BIT_CLK_GATED)) != 0U) {
		return -ENOTSUP;
	}

	if (cfg->mem_slab == NULL) {
		return -EINVAL;
	}

	if (cfg->block_size == 0U) {
		return -EINVAL;
	}

	if ((cfg->block_size % 4U) != 0U) {
		return -EINVAL;
	}

	if ((cfg->block_size % sizeof(uint16_t)) != 0U) {
		return -EINVAL;
	}

	if (cfg->timeout < -1) {
		return -EINVAL;
	}

	return 0;
}

static int gd32_i2s_stream_start(struct stream *stream)
{
	const struct i2s_gd32_config *cfg = stream->dev->config;
	struct i2s_gd32_data *data = stream->dev->data;
	k_spinlock_key_t key;
	int ret;

	key = k_spin_lock(&data->lock);
	(void)k_work_cancel_delayable(&stream->stop_work);
	stream->disable_pending = false;
	k_spin_unlock(&data->lock, key);

	memset(&stream->dma_cfg, 0, sizeof(stream->dma_cfg));
	memset(&stream->dma_blk, 0, sizeof(stream->dma_blk));

	stream->dma_cfg.dma_callback = gd32_i2s_dma_callback;
	stream->dma_cfg.user_data = stream;
	stream->dma_cfg.block_count = 1U;
	stream->dma_cfg.head_block = &stream->dma_blk;
	stream->dma_cfg.dma_slot = stream->dma_slot;
	stream->dma_cfg.channel_priority = stream->dma_priority;
	stream->dma_cfg.source_burst_length = 1U;
	stream->dma_cfg.dest_burst_length = 1U;
	stream->dma_cfg.source_data_size = 2U;
	stream->dma_cfg.dest_data_size = 2U;

	if (stream->dir == I2S_DIR_RX) {
		ret = k_mem_slab_alloc(stream->cfg.mem_slab, &stream->mem_block, K_NO_WAIT);
		if (ret < 0) {
			return -ENOMEM;
		}

		stream->mem_block_size = stream->cfg.block_size;

		stream->dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
		stream->dma_blk.source_address = (uint32_t)&SPI_DATA(cfg->reg);
		stream->dma_blk.dest_address = (uint32_t)stream->mem_block;
		stream->dma_blk.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		stream->dma_blk.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		stream->dma_blk.block_size = gd32_i2s_dma_xfer_count(stream->cfg.block_size);

		ret = dma_config(stream->dma_dev, stream->dma_channel, &stream->dma_cfg);
		if (ret < 0) {
			k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
			stream->mem_block = NULL;
			return ret;
		}

		ret = dma_start(stream->dma_dev, stream->dma_channel);
		if (ret < 0) {
			gd32_i2s_rx_disable(stream);
			return ret;
		}

		SPI_CTL1(cfg->reg) |= SPI_CTL1_ERRIE;
		spi_dma_enable(cfg->reg, SPI_DMA_RECEIVE);
		i2s_enable(cfg->reg);
		return 0;
	}

