egilll/zephyr-gd32/drivers/i2s/i2s_gd32.c
	ret = queue_get(stream->msgq, &stream->mem_block, &stream->mem_block_size, 0);
	if (ret < 0) {
		return -EIO;
	}

	if (stream->mem_block_size == 0U || stream->mem_block_size > stream->cfg.block_size) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
		stream->mem_block_size = 0;
		return -EINVAL;
	}

	if ((stream->mem_block_size % 4U) != 0U) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
		stream->mem_block_size = 0;
		return -EINVAL;
	}

	sys_cache_data_flush_range(stream->mem_block, stream->mem_block_size);

	stream->dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
	stream->dma_blk.source_address = (uint32_t)stream->mem_block;
	stream->dma_blk.dest_address = (uint32_t)&SPI_DATA(cfg->reg);
	stream->dma_blk.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	stream->dma_blk.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	stream->dma_blk.block_size = gd32_i2s_dma_xfer_count(stream->mem_block_size);

	ret = dma_config(stream->dma_dev, stream->dma_channel, &stream->dma_cfg);
	if (ret < 0) {
		k_mem_slab_free(stream->cfg.mem_slab, stream->mem_block);
		stream->mem_block = NULL;
		stream->mem_block_size = 0;
		return ret;
	}

	ret = dma_start(stream->dma_dev, stream->dma_channel);
	if (ret < 0) {
		gd32_i2s_tx_disable_dma(stream);
		gd32_i2s_request_tx_disable(stream);
		return ret;
	}
	stream->last_block_start_cycle = k_cycle_get_32();

	SPI_CTL1(cfg->reg) |= SPI_CTL1_ERRIE;
	spi_dma_enable(cfg->reg, SPI_DMA_TRANSMIT);
	i2s_enable(cfg->reg);
	return 0;
}

uint32_t i2s_gd32_tx_block_start_cycle_get(const struct device *dev)
{
	struct i2s_gd32_data *data = dev->data;

	return data->tx.last_block_start_cycle;
}

static void gd32_i2s_stream_disable(struct stream *stream)
{
	if (stream->dir == I2S_DIR_RX) {
		gd32_i2s_rx_disable(stream);
	} else {
		gd32_i2s_tx_disable_dma(stream);
		gd32_i2s_request_tx_disable(stream);
	}
}

static void i2s_gd32_isr(const struct device *dev)
{
	const struct i2s_gd32_config *cfg = dev->config;
	struct i2s_gd32_data *data = dev->data;
	const uint32_t err_mask = SPI_STAT_RXORERR | SPI_STAT_TXURERR | SPI_STAT_CONFERR |
				  SPI_STAT_FERR;

	if ((SPI_STAT(cfg->reg) & err_mask) == 0U) {
		return;
	}

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	data->rx.state = I2S_STATE_ERROR;
	data->tx.state = I2S_STATE_ERROR;

	SPI_CTL1(cfg->reg) &= ~SPI_CTL1_ERRIE;
	spi_dma_disable(cfg->reg, SPI_DMA_RECEIVE);
	spi_dma_disable(cfg->reg, SPI_DMA_TRANSMIT);
	(void)dma_stop(data->rx.dma_dev, data->rx.dma_channel);
	(void)dma_stop(data->tx.dma_dev, data->tx.dma_channel);
	i2s_disable(cfg->reg);

	if (data->rx.mem_block != NULL) {
		k_mem_slab_free(data->rx.cfg.mem_slab, data->rx.mem_block);
		data->rx.mem_block = NULL;
	}
	if (data->tx.mem_block != NULL) {
		k_mem_slab_free(data->tx.cfg.mem_slab, data->tx.mem_block);
		data->tx.mem_block = NULL;
		data->tx.mem_block_size = 0;
	}

	k_spin_unlock(&data->lock, key);
}

static int i2s_gd32_configure(const struct device *dev, enum i2s_dir dir, const struct i2s_config *i2s_cfg)
{
	const struct i2s_gd32_config *cfg = dev->config;
	struct i2s_gd32_data *data = dev->data;
	struct stream *stream;
	uint32_t std;
	uint32_t ckpl = I2S_CKPL_LOW;
	uint32_t mode;
	uint32_t frameformat;
	int ret;

	if (dir == I2S_DIR_RX) {
		stream = &data->rx;
	} else if (dir == I2S_DIR_TX) {
		stream = &data->tx;
	} else if (dir == I2S_DIR_BOTH) {
		return -ENOSYS;
	} else {
		return -EINVAL;
	}

	k_spinlock_key_t key = k_spin_lock(&data->lock);
	if (stream->state != I2S_STATE_NOT_READY && stream->state != I2S_STATE_READY) {
		k_spin_unlock(&data->lock, key);
		return -EINVAL;
	}
	if (data->rx.state == I2S_STATE_RUNNING || data->tx.state == I2S_STATE_RUNNING ||
	    data->rx.state == I2S_STATE_STOPPING || data->tx.state == I2S_STATE_STOPPING) {
		k_spin_unlock(&data->lock, key);
		return -EBUSY;
	}
	k_spin_unlock(&data->lock, key);

	if (i2s_cfg->frame_clk_freq == 0U) {
		gd32_i2s_stream_disable(stream);
		stream_queue_drop(stream);
		memset(&stream->cfg, 0, sizeof(stream->cfg));
		key = k_spin_lock(&data->lock);
		stream->state = I2S_STATE_NOT_READY;
		k_spin_unlock(&data->lock, key);
		return 0;
	}

	ret = gd32_i2s_validate_config(i2s_cfg);
	if (ret < 0) {
		return ret;
	}

	ret = gd32_std_from_config(i2s_cfg, &std);
	if (ret < 0) {
		return ret;
	}

	ret = gd32_frameformat_from_config(i2s_cfg, &frameformat);
	if (ret < 0) {
		return ret;
	}

	if ((i2s_cfg->format & I2S_FMT_CLK_FORMAT_MASK) & I2S_FMT_BIT_CLK_INV) {
		ckpl = I2S_CKPL_HIGH;
	}

	if (((i2s_cfg->options & I2S_OPT_FRAME_CLK_SLAVE) != 0U) !=
	    ((i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE) != 0U)) {
		return -EINVAL;
	}

	stream->master = (i2s_cfg->options & I2S_OPT_FRAME_CLK_SLAVE) == 0U;

	key = k_spin_lock(&data->lock);
	memcpy(&stream->cfg, i2s_cfg, sizeof(stream->cfg));
	k_spin_unlock(&data->lock, key);

	if (dir == I2S_DIR_TX) {
		mode = stream->master ? I2S_MODE_MASTERTX : I2S_MODE_SLAVETX;
	} else {
		mode = stream->master ? I2S_MODE_MASTERRX : I2S_MODE_SLAVERX;
	}

	i2s_disable(cfg->reg);
	spi_dma_disable(cfg->reg, SPI_DMA_RECEIVE);
	spi_dma_disable(cfg->reg, SPI_DMA_TRANSMIT);
	SPI_CTL1(cfg->reg) &= ~SPI_CTL1_ERRIE;

	i2s_init(cfg->reg, mode, std, ckpl);

	if (stream->master) {
		ret = gd32_i2s_psc_config(cfg->reg, i2s_cfg->frame_clk_freq, frameformat,
					  cfg->mck_enabled ? I2S_MCKOUT_ENABLE :
							    I2S_MCKOUT_DISABLE);
		if (ret < 0) {
			return ret;
		}
	} else {
		gd32_i2s_frameformat_apply(cfg->reg, frameformat);
		if (cfg->mck_enabled) {
			SPI_I2SPSC(cfg->reg) |= SPI_I2SPSC_MCKOEN;
		} else {
			SPI_I2SPSC(cfg->reg) &= ~SPI_I2SPSC_MCKOEN;
		}
	}

	key = k_spin_lock(&data->lock);
	stream->state = I2S_STATE_READY;
	k_spin_unlock(&data->lock, key);
	return 0;
}

static const struct i2s_config *i2s_gd32_config_get(const struct device *dev, enum i2s_dir dir)
{
	struct i2s_gd32_data *data = dev->data;
	struct stream *stream;

	if (dir == I2S_DIR_RX) {
		stream = &data->rx;
	} else if (dir == I2S_DIR_TX) {
		stream = &data->tx;
	} else {
		return NULL;
	}

	if (stream->state == I2S_STATE_NOT_READY) {
		return NULL;
	}

	return &stream->cfg;
}

static int i2s_gd32_trigger(const struct device *dev, enum i2s_dir dir, enum i2s_trigger_cmd cmd)
{
	struct i2s_gd32_data *data = dev->data;
	struct stream *stream;
	k_spinlock_key_t key;
	int ret;

