egilll/zephyr-gd32/drivers/i2s/i2s_gd32.c
	if (dir == I2S_DIR_RX) {
		stream = &data->rx;
	} else if (dir == I2S_DIR_TX) {
		stream = &data->tx;
	} else if (dir == I2S_DIR_BOTH) {
		return -ENOSYS;
	} else {
		return -EINVAL;
	}

	switch (cmd) {
	case I2S_TRIGGER_START:
		key = k_spin_lock(&data->lock);
		if (stream->state != I2S_STATE_READY) {
			k_spin_unlock(&data->lock, key);
			return -EIO;
		}
		k_spin_unlock(&data->lock, key);

		ret = gd32_i2s_stream_start(stream);
		if (ret < 0) {
			return ret;
		}

		key = k_spin_lock(&data->lock);
		stream->state = I2S_STATE_RUNNING;
		stream->tx_stop_for_drain = false;
		k_spin_unlock(&data->lock, key);
		return 0;

	case I2S_TRIGGER_STOP:
		key = k_spin_lock(&data->lock);
		if (stream->state != I2S_STATE_RUNNING) {
			k_spin_unlock(&data->lock, key);
			return -EIO;
		}
		if (gd32_i2s_dma_busy(stream)) {
			stream->state = I2S_STATE_STOPPING;
			stream->tx_stop_for_drain = false;
		} else {
			gd32_i2s_stream_disable(stream);
			stream->state = I2S_STATE_READY;
		}
		k_spin_unlock(&data->lock, key);
		return 0;

	case I2S_TRIGGER_DRAIN:
		key = k_spin_lock(&data->lock);
		if (stream->state != I2S_STATE_RUNNING) {
			k_spin_unlock(&data->lock, key);
			return -EIO;
		}
		if (dir == I2S_DIR_TX) {
			if (!queue_is_empty(stream->msgq) || gd32_i2s_dma_busy(stream)) {
				stream->state = I2S_STATE_STOPPING;
				stream->tx_stop_for_drain = true;
			} else {
				gd32_i2s_stream_disable(stream);
				stream->state = I2S_STATE_READY;
			}
		} else {
			stream->state = I2S_STATE_STOPPING;
		}
		k_spin_unlock(&data->lock, key);
		return 0;

	case I2S_TRIGGER_DROP:
		key = k_spin_lock(&data->lock);
		if (stream->state == I2S_STATE_NOT_READY) {
			k_spin_unlock(&data->lock, key);
			return -EIO;
		}
		k_spin_unlock(&data->lock, key);

		gd32_i2s_stream_disable(stream);
		stream_queue_drop(stream);

		key = k_spin_lock(&data->lock);
		stream->state = I2S_STATE_READY;
		k_spin_unlock(&data->lock, key);
		return 0;

	case I2S_TRIGGER_PREPARE:
		key = k_spin_lock(&data->lock);
		if (stream->state != I2S_STATE_ERROR) {
			k_spin_unlock(&data->lock, key);
			return -EIO;
		}
		k_spin_unlock(&data->lock, key);

		gd32_i2s_stream_disable(stream);
		stream_queue_drop(stream);
		(void)reset_line_toggle_dt(&((const struct i2s_gd32_config *)dev->config)->reset);
		ret = i2s_gd32_configure(dev, stream->dir, &stream->cfg);
		if (ret < 0) {
			key = k_spin_lock(&data->lock);
			stream->state = I2S_STATE_ERROR;
			k_spin_unlock(&data->lock, key);
			return ret;
		}
		return 0;

	default:
		return -EINVAL;
	}
}

static int i2s_gd32_read(const struct device *dev, void **mem_block, size_t *size)
{
	struct i2s_gd32_data *data = dev->data;
	int ret;

	if (data->rx.state == I2S_STATE_NOT_READY) {
		return -EIO;
	}

	ret = queue_get(data->rx.msgq, mem_block, size, data->rx.cfg.timeout);
	if (ret < 0) {
		return (data->rx.state == I2S_STATE_ERROR) ? -EIO : ret;
	}

	return 0;
}

static int i2s_gd32_write(const struct device *dev, void *mem_block, size_t size)
{
	struct i2s_gd32_data *data = dev->data;

	if (data->tx.state != I2S_STATE_RUNNING && data->tx.state != I2S_STATE_READY) {
		return -EIO;
	}

	if (size == 0U || size > data->tx.cfg.block_size) {
		return -EINVAL;
	}

	if ((size % 4U) != 0U) {
		return -EINVAL;
	}

	return queue_put(data->tx.msgq, mem_block, size, data->tx.cfg.timeout);
}

static DEVICE_API(i2s, i2s_gd32_driver_api) = {
	.configure = i2s_gd32_configure,
	.config_get = i2s_gd32_config_get,
	.read = i2s_gd32_read,
	.write = i2s_gd32_write,
	.trigger = i2s_gd32_trigger,
};

static int i2s_gd32_init(const struct device *dev)
{
	const struct i2s_gd32_config *cfg = dev->config;
	struct i2s_gd32_data *data = dev->data;
	uint32_t ch_filter;
	int ret;

	(void)clock_control_on(GD32_CLOCK_CONTROLLER, (clock_control_subsys_t)&cfg->clkid);
	(void)reset_line_toggle_dt(&cfg->reset);

	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret != 0) {
		return ret;
	}

	if (!device_is_ready(cfg->dma_tx.dev) || !device_is_ready(cfg->dma_rx.dev)) {
		return -ENODEV;
	}

	ch_filter = BIT(cfg->dma_tx.channel);
	ret = dma_request_channel(cfg->dma_tx.dev, &ch_filter);
	if (ret < 0) {
		return ret;
	}

	ch_filter = BIT(cfg->dma_rx.channel);
	ret = dma_request_channel(cfg->dma_rx.dev, &ch_filter);
	if (ret < 0) {
		return ret;
	}

	data->tx.dev = dev;
	data->tx.dir = I2S_DIR_TX;
	data->tx.state = I2S_STATE_NOT_READY;
	data->tx.dma_dev = cfg->dma_tx.dev;
	data->tx.dma_channel = cfg->dma_tx.channel;
	data->tx.dma_slot = cfg->dma_tx.slot;
	data->tx.dma_priority = GD32_DMA_CONFIG_PRIORITY(cfg->dma_tx.config);
	k_work_init_delayable(&data->tx.stop_work, gd32_i2s_tx_stop_work);

	data->rx.dev = dev;
	data->rx.dir = I2S_DIR_RX;
	data->rx.state = I2S_STATE_NOT_READY;
	data->rx.dma_dev = cfg->dma_rx.dev;
	data->rx.dma_channel = cfg->dma_rx.channel;
	data->rx.dma_slot = cfg->dma_rx.slot;
	data->rx.dma_priority = GD32_DMA_CONFIG_PRIORITY(cfg->dma_rx.config);
	k_work_init_delayable(&data->rx.stop_work, gd32_i2s_noop_work);

	cfg->irq_configure(dev);
	return 0;
}

#define DMA_INITIALIZER(idx, dir)                                                       \
	{                                                                                   \
		.dev = DEVICE_DT_GET(DT_INST_DMAS_CTLR_BY_NAME(idx, dir)),                      \
		.channel = DT_INST_DMAS_CELL_BY_NAME(idx, dir, channel),                        \
		.slot = COND_CODE_1(DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1),                  \
				    (DT_INST_DMAS_CELL_BY_NAME(idx, dir, slot)), (0)),          \
		.config = DT_INST_DMAS_CELL_BY_NAME(idx, dir, config),                          \
		.fifo_threshold = COND_CODE_1(DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1),        \
					      (DT_INST_DMAS_CELL_BY_NAME(idx, dir, fifo_threshold)), (0)), \
	}

#define DMA_BY_NAME(idx, dir)                                                           \
	COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, dir), (DMA_INITIALIZER(idx, dir)), ({0}))

#define I2S_GD32_INIT(inst)                                                             \
	PINCTRL_DT_INST_DEFINE(inst);                                                       \
	K_MSGQ_DEFINE(rx_##inst##_queue, sizeof(struct queue_item),                          \
		      CONFIG_I2S_GD32_RX_BLOCK_COUNT, 4);                                   \
	K_MSGQ_DEFINE(tx_##inst##_queue, sizeof(struct queue_item),                          \
		      CONFIG_I2S_GD32_TX_BLOCK_COUNT, 4);                                   \
	static void i2s_gd32_irq_configure_##inst(const struct device *dev)                  \
	{                                                                                   \
		IRQ_CONNECT(DT_INST_IRQN(inst), DT_INST_IRQ(inst, priority),                     \
			    i2s_gd32_isr, DEVICE_DT_INST_GET(inst), 0);                          \
		irq_enable(DT_INST_IRQN(inst));                                                  \
		ARG_UNUSED(dev);                                                                 \
	}                                                                                   \
	static struct i2s_gd32_data i2s_gd32_data_##inst = {                                 \
		.rx = {.msgq = &rx_##inst##_queue, .state = I2S_STATE_NOT_READY},                \
		.tx = {.msgq = &tx_##inst##_queue, .state = I2S_STATE_NOT_READY},                \
	};                                                                                  \
	static const struct i2s_gd32_config i2s_gd32_config_##inst = {                       \
		.reg = DT_INST_REG_ADDR(inst),                                                  \
		.clkid = DT_INST_CLOCKS_CELL(inst, id),                                         \
		.reset = RESET_DT_SPEC_INST_GET(inst),                                          \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                   \
		.mck_enabled = DT_INST_PROP_OR(inst, mck_enabled, 0),                           \
		.irq_configure = i2s_gd32_irq_configure_##inst,                                 \
		.dma_rx = DMA_BY_NAME(inst, rx),                                                \
		.dma_tx = DMA_BY_NAME(inst, tx),                                                \
	};                                                                                  \
	DEVICE_DT_INST_DEFINE(inst, i2s_gd32_init, NULL,                                    \
			      &i2s_gd32_data_##inst, &i2s_gd32_config_##inst,               \
			      POST_KERNEL, CONFIG_I2S_INIT_PRIORITY,                        \
			      &i2s_gd32_driver_api)

DT_INST_FOREACH_STATUS_OKAY(I2S_GD32_INIT)
